In [1]:
import numpy as np
import pandas as pd

In [2]:
olympic_Participants_Series = pd.Series([205,204,201,200,197], index = [2012 , 2008 , 2004 ,2000 , 1996])

olympic_Hosts_Series = pd.Series(['London' , 'Tokyo', 'Athens', 'Sydney' , 'Atlanta'],index = [2012 , 2008 , 2004 ,2000 , 1996])

olympic_DataFrame = pd.DataFrame({"No of Participants" : olympic_Participants_Series ,"Hosts" : olympic_Hosts_Series})

In [3]:
olympic_DataFrame

      No of Participants    Hosts
2012                 205   London
2008                 204    Tokyo
2004                 201   Athens
2000                 200   Sydney
1996                 197  Atlanta

In [4]:
olympic_DataFrame.describe

<bound method NDFrame.describe of       No of Participants    Hosts
2012                 205   London
2008                 204    Tokyo
2004                 201   Athens
2000                 200   Sydney
1996                 197  Atlanta>

In [5]:
olympic_DataFrame.head(2)

      No of Participants   Hosts
2012                 205  London
2008                 204   Tokyo

In [6]:
(olympic_DataFrame.head(-2))

      No of Participants   Hosts
2012                 205  London
2008                 204   Tokyo
2004                 201  Athens

In [7]:
(olympic_DataFrame.tail(3))

      No of Participants    Hosts
2004                 201   Athens
2000                 200   Sydney
1996                 197  Atlanta

In [8]:
olympic_DataFrame.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [9]:
olympic_DataFrame.columns

Index(['No of Participants', 'Hosts'], dtype='object')

In [10]:
olympic_DataFrame.Hosts

2012     London
2008      Tokyo
2004     Athens
2000     Sydney
1996    Atlanta
Name: Hosts, dtype: object

In [11]:
olympic_DataFrame['No of Participants']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No of Participants, dtype: int64

In [12]:
olympic_DataFrame.loc[2012]

No of Participants       205
Hosts                 London
Name: 2012, dtype: object

In [13]:
olympic_DataFrame.iloc[1]

No of Participants      204
Hosts                 Tokyo
Name: 2008, dtype: object

In [14]:
olympic_DataFrame.iloc[0:3]

      No of Participants   Hosts
2012                 205  London
2008                 204   Tokyo
2004                 201  Athens

In [15]:
print(olympic_DataFrame.iat[2,0],end = '  ')
print(olympic_DataFrame.iat[2,1])

201  Athens

In [16]:
olympic_DataFrame['No of Participants'] >= 200

2012     True
2008     True
2004     True
2000     True
1996    False
Name: No of Participants, dtype: bool

In [17]:
olympic_DataFrame[olympic_DataFrame['No of Participants'] >= 200]

      No of Participants   Hosts
2012                 205  London
2008                 204   Tokyo
2004                 201  Athens
2000                 200  Sydney